//Задание 6
//Есть прямоугольник, у которого известна ширина w и
//высота h. Найти и вывести на консоль периметр и площадь
//заданного прямоугольника. Высота и ширина прямоугольника должна задаваться константными переменными в коде
//программы.

public class Task06 {
    public static void main(String[] args) {
        final int w = 20;
        final int h = 40;
        System.out.println("Периметр прямоугольника "+(2*w+2*h));
        System.out.println("Площадь прямоугольника "+(w*h));

    }

}
