//Задание 5
//Подсчитать площадь и длину окружности для круга с радиусом R. Радиус должен быть задан константой в программе.
// Вывести результат на консоль.
public class Task05 {
    public static void main(String[] args) {
    final double R=12.34;
        System.out.println("Длина окружности "+(2+Math.PI*R));
        System.out.println("Площадь окружности "+(Math.PI*R*R));
    }
}
