// Задание 3
//В переменной n хранится вещественное число, с ненулевой дробной частью. Создайте программу, округляющую
//число n до ближайшего целого и выводящую результат
//округления на экран
public class Task03 {
    public static void main(String[] args) {
        double n = 12.3435;
        System.out.println("Округление до ближайшего целого числа 12.3435   "+Math.round(n));
    }
}
